HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCan_bf.h
/** \brief Offset for Ifx_CAN_N_GRINT1_Bits.SAFE */
#define IFX_CAN_N_GRINT1_SAFE_OFF (20u)

/** \brief Length for Ifx_CAN_N_GRINT1_Bits.BOFF */
#define IFX_CAN_N_GRINT1_BOFF_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT1_Bits.BOFF */
#define IFX_CAN_N_GRINT1_BOFF_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT1_Bits.BOFF */
#define IFX_CAN_N_GRINT1_BOFF_OFF (24u)

/** \brief Length for Ifx_CAN_N_GRINT1_Bits.LOI */
#define IFX_CAN_N_GRINT1_LOI_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT1_Bits.LOI */
#define IFX_CAN_N_GRINT1_LOI_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT1_Bits.LOI */
#define IFX_CAN_N_GRINT1_LOI_OFF (28u)

/** \brief Length for Ifx_CAN_N_GRINT2_Bits.REINT */
#define IFX_CAN_N_GRINT2_REINT_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT2_Bits.REINT */
#define IFX_CAN_N_GRINT2_REINT_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT2_Bits.REINT */
#define IFX_CAN_N_GRINT2_REINT_OFF (0u)

/** \brief Length for Ifx_CAN_N_GRINT2_Bits.RxF1F */
#define IFX_CAN_N_GRINT2_RXF1F_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT2_Bits.RxF1F */
#define IFX_CAN_N_GRINT2_RXF1F_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT2_Bits.RxF1F */
#define IFX_CAN_N_GRINT2_RXF1F_OFF (4u)

/** \brief Length for Ifx_CAN_N_GRINT2_Bits.RxF0F */
#define IFX_CAN_N_GRINT2_RXF0F_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT2_Bits.RxF0F */
#define IFX_CAN_N_GRINT2_RXF0F_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT2_Bits.RxF0F */
#define IFX_CAN_N_GRINT2_RXF0F_OFF (8u)

/** \brief Length for Ifx_CAN_N_GRINT2_Bits.RxF1N */
#define IFX_CAN_N_GRINT2_RXF1N_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT2_Bits.RxF1N */
#define IFX_CAN_N_GRINT2_RXF1N_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT2_Bits.RxF1N */
#define IFX_CAN_N_GRINT2_RXF1N_OFF (12u)

/** \brief Length for Ifx_CAN_N_GRINT2_Bits.RxF0N */
#define IFX_CAN_N_GRINT2_RXF0N_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT2_Bits.RxF0N */
#define IFX_CAN_N_GRINT2_RXF0N_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT2_Bits.RxF0N */
#define IFX_CAN_N_GRINT2_RXF0N_OFF (16u)

/** \brief Length for Ifx_CAN_N_GRINT2_Bits.RETI */
#define IFX_CAN_N_GRINT2_RETI_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT2_Bits.RETI */
#define IFX_CAN_N_GRINT2_RETI_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT2_Bits.RETI */
#define IFX_CAN_N_GRINT2_RETI_OFF (20u)

/** \brief Length for Ifx_CAN_N_GRINT2_Bits.TRAQ */
#define IFX_CAN_N_GRINT2_TRAQ_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT2_Bits.TRAQ */
#define IFX_CAN_N_GRINT2_TRAQ_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT2_Bits.TRAQ */
#define IFX_CAN_N_GRINT2_TRAQ_OFF (24u)

/** \brief Length for Ifx_CAN_N_GRINT2_Bits.TRACO */
#define IFX_CAN_N_GRINT2_TRACO_LEN (4u)

/** \brief Mask for Ifx_CAN_N_GRINT2_Bits.TRACO */
#define IFX_CAN_N_GRINT2_TRACO_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_GRINT2_Bits.TRACO */
#define IFX_CAN_N_GRINT2_TRACO_OFF (28u)

/** \brief Length for Ifx_CAN_N_NT_CCR_Bits.TPSC */
#define IFX_CAN_N_NT_CCR_TPSC_LEN (4u)

/** \brief Mask for Ifx_CAN_N_NT_CCR_Bits.TPSC */
#define IFX_CAN_N_NT_CCR_TPSC_MSK (0xfu)

/** \brief Offset for Ifx_CAN_N_NT_CCR_Bits.TPSC */
#define IFX_CAN_N_NT_CCR_TPSC_OFF (8u)

/** \brief Length for Ifx_CAN_N_NT_CCR_Bits.STRESET */
#define IFX_CAN_N_NT_CCR_STRESET_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_CCR_Bits.STRESET */
#define IFX_CAN_N_NT_CCR_STRESET_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_CCR_Bits.STRESET */
#define IFX_CAN_N_NT_CCR_STRESET_OFF (14u)

/** \brief Length for Ifx_CAN_N_NT_CCR_Bits.STSTART */
#define IFX_CAN_N_NT_CCR_STSTART_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_CCR_Bits.STSTART */
#define IFX_CAN_N_NT_CCR_STSTART_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_CCR_Bits.STSTART */
#define IFX_CAN_N_NT_CCR_STSTART_OFF (15u)

/** \brief Length for Ifx_CAN_N_NT_CCR_Bits.TRIGSRC */
#define IFX_CAN_N_NT_CCR_TRIGSRC_LEN (3u)

/** \brief Mask for Ifx_CAN_N_NT_CCR_Bits.TRIGSRC */
#define IFX_CAN_N_NT_CCR_TRIGSRC_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_NT_CCR_Bits.TRIGSRC */
#define IFX_CAN_N_NT_CCR_TRIGSRC_OFF (18u)

/** \brief Length for Ifx_CAN_N_NT_ATTR_Bits.RELOAD */
#define IFX_CAN_N_NT_ATTR_RELOAD_LEN (16u)

/** \brief Mask for Ifx_CAN_N_NT_ATTR_Bits.RELOAD */
#define IFX_CAN_N_NT_ATTR_RELOAD_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_NT_ATTR_Bits.RELOAD */
#define IFX_CAN_N_NT_ATTR_RELOAD_OFF (0u)

/** \brief Length for Ifx_CAN_N_NT_ATTR_Bits.TXMO */
#define IFX_CAN_N_NT_ATTR_TXMO_LEN (8u)

/** \brief Mask for Ifx_CAN_N_NT_ATTR_Bits.TXMO */
#define IFX_CAN_N_NT_ATTR_TXMO_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_NT_ATTR_Bits.TXMO */
#define IFX_CAN_N_NT_ATTR_TXMO_OFF (16u)

/** \brief Length for Ifx_CAN_N_NT_ATTR_Bits.STRT */
#define IFX_CAN_N_NT_ATTR_STRT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_ATTR_Bits.STRT */
#define IFX_CAN_N_NT_ATTR_STRT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_ATTR_Bits.STRT */
#define IFX_CAN_N_NT_ATTR_STRT_OFF (24u)

/** \brief Length for Ifx_CAN_N_NT_BTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_BTTR_RELOAD_LEN (16u)

/** \brief Mask for Ifx_CAN_N_NT_BTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_BTTR_RELOAD_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_NT_BTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_BTTR_RELOAD_OFF (0u)

/** \brief Length for Ifx_CAN_N_NT_BTTR_Bits.TXMO */
#define IFX_CAN_N_NT_BTTR_TXMO_LEN (8u)

/** \brief Mask for Ifx_CAN_N_NT_BTTR_Bits.TXMO */
#define IFX_CAN_N_NT_BTTR_TXMO_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_NT_BTTR_Bits.TXMO */
#define IFX_CAN_N_NT_BTTR_TXMO_OFF (16u)

/** \brief Length for Ifx_CAN_N_NT_BTTR_Bits.STRT */
#define IFX_CAN_N_NT_BTTR_STRT_LEN (1u)

/** \brief Mask for Ifx_CAN_N_NT_BTTR_Bits.STRT */
#define IFX_CAN_N_NT_BTTR_STRT_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_NT_BTTR_Bits.STRT */
#define IFX_CAN_N_NT_BTTR_STRT_OFF (24u)

/** \brief Length for Ifx_CAN_N_NT_CTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_CTTR_RELOAD_LEN (16u)

/** \brief Mask for Ifx_CAN_N_NT_CTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_CTTR_RELOAD_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_N_NT_CTTR_Bits.RELOAD */
#define IFX_CAN_N_NT_CTTR_RELOAD_OFF (0u)

