HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_RX_F1S_Bits.F1F */
#define IFX_CAN_N_RX_F1S_F1F_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F1S_Bits.F1F */
#define IFX_CAN_N_RX_F1S_F1F_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F1S_Bits.F1F */
#define IFX_CAN_N_RX_F1S_F1F_OFF (24u)

/** \brief Length for Ifx_CAN_N_RX_F1S_Bits.RF1L */
#define IFX_CAN_N_RX_F1S_RF1L_LEN (1u)

/** \brief Mask for Ifx_CAN_N_RX_F1S_Bits.RF1L */
#define IFX_CAN_N_RX_F1S_RF1L_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_RX_F1S_Bits.RF1L */
#define IFX_CAN_N_RX_F1S_RF1L_OFF (25u)

/** \brief Length for Ifx_CAN_N_RX_F1A_Bits.F1AI */
#define IFX_CAN_N_RX_F1A_F1AI_LEN (6u)

/** \brief Mask for Ifx_CAN_N_RX_F1A_Bits.F1AI */
#define IFX_CAN_N_RX_F1A_F1AI_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_RX_F1A_Bits.F1AI */
#define IFX_CAN_N_RX_F1A_F1AI_OFF (0u)

/** \brief Length for Ifx_CAN_N_RX_ESC_Bits.F0DS */
#define IFX_CAN_N_RX_ESC_F0DS_LEN (3u)

/** \brief Mask for Ifx_CAN_N_RX_ESC_Bits.F0DS */
#define IFX_CAN_N_RX_ESC_F0DS_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_RX_ESC_Bits.F0DS */
#define IFX_CAN_N_RX_ESC_F0DS_OFF (0u)

/** \brief Length for Ifx_CAN_N_RX_ESC_Bits.F1DS */
#define IFX_CAN_N_RX_ESC_F1DS_LEN (3u)

/** \brief Mask for Ifx_CAN_N_RX_ESC_Bits.F1DS */
#define IFX_CAN_N_RX_ESC_F1DS_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_RX_ESC_Bits.F1DS */
#define IFX_CAN_N_RX_ESC_F1DS_OFF (4u)

/** \brief Length for Ifx_CAN_N_RX_ESC_Bits.RBDS */
#define IFX_CAN_N_RX_ESC_RBDS_LEN (3u)

/** \brief Mask for Ifx_CAN_N_RX_ESC_Bits.RBDS */
#define IFX_CAN_N_RX_ESC_RBDS_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_RX_ESC_Bits.RBDS */
#define IFX_CAN_N_RX_ESC_RBDS_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BC_Bits.TBSA */
#define IFX_CAN_N_TX_BC_TBSA_LEN (14u)

/** \brief Mask for Ifx_CAN_N_TX_BC_Bits.TBSA */
#define IFX_CAN_N_TX_BC_TBSA_MSK (0x3fffu)

/** \brief Offset for Ifx_CAN_N_TX_BC_Bits.TBSA */
#define IFX_CAN_N_TX_BC_TBSA_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BC_Bits.NDTB */
#define IFX_CAN_N_TX_BC_NDTB_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_BC_Bits.NDTB */
#define IFX_CAN_N_TX_BC_NDTB_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_BC_Bits.NDTB */
#define IFX_CAN_N_TX_BC_NDTB_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BC_Bits.TFQS */
#define IFX_CAN_N_TX_BC_TFQS_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_BC_Bits.TFQS */
#define IFX_CAN_N_TX_BC_TFQS_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_BC_Bits.TFQS */
#define IFX_CAN_N_TX_BC_TFQS_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BC_Bits.TFQM */
#define IFX_CAN_N_TX_BC_TFQM_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BC_Bits.TFQM */
#define IFX_CAN_N_TX_BC_TFQM_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BC_Bits.TFQM */
#define IFX_CAN_N_TX_BC_TFQM_OFF (30u)

/** \brief Length for Ifx_CAN_N_TX_FQS_Bits.TFFL */
#define IFX_CAN_N_TX_FQS_TFFL_LEN (6u)

/** \brief Mask for Ifx_CAN_N_TX_FQS_Bits.TFFL */
#define IFX_CAN_N_TX_FQS_TFFL_MSK (0x3fu)

/** \brief Offset for Ifx_CAN_N_TX_FQS_Bits.TFFL */
#define IFX_CAN_N_TX_FQS_TFFL_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_FQS_Bits.TFGI */
#define IFX_CAN_N_TX_FQS_TFGI_LEN (5u)

/** \brief Mask for Ifx_CAN_N_TX_FQS_Bits.TFGI */
#define IFX_CAN_N_TX_FQS_TFGI_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_TX_FQS_Bits.TFGI */
#define IFX_CAN_N_TX_FQS_TFGI_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_FQS_Bits.TFQPI */
#define IFX_CAN_N_TX_FQS_TFQPI_LEN (5u)

/** \brief Mask for Ifx_CAN_N_TX_FQS_Bits.TFQPI */
#define IFX_CAN_N_TX_FQS_TFQPI_MSK (0x1fu)

/** \brief Offset for Ifx_CAN_N_TX_FQS_Bits.TFQPI */
#define IFX_CAN_N_TX_FQS_TFQPI_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_FQS_Bits.TFQF */
#define IFX_CAN_N_TX_FQS_TFQF_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_FQS_Bits.TFQF */
#define IFX_CAN_N_TX_FQS_TFQF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_FQS_Bits.TFQF */
#define IFX_CAN_N_TX_FQS_TFQF_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_ESC_Bits.TBDS */
#define IFX_CAN_N_TX_ESC_TBDS_LEN (3u)

/** \brief Mask for Ifx_CAN_N_TX_ESC_Bits.TBDS */
#define IFX_CAN_N_TX_ESC_TBDS_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_TX_ESC_Bits.TBDS */
#define IFX_CAN_N_TX_ESC_TBDS_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP0 */
#define IFX_CAN_N_TX_BRP_TRP0_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP0 */
#define IFX_CAN_N_TX_BRP_TRP0_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP0 */
#define IFX_CAN_N_TX_BRP_TRP0_OFF (0u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP1 */
#define IFX_CAN_N_TX_BRP_TRP1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP1 */
#define IFX_CAN_N_TX_BRP_TRP1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP1 */
#define IFX_CAN_N_TX_BRP_TRP1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP2 */
#define IFX_CAN_N_TX_BRP_TRP2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP2 */
#define IFX_CAN_N_TX_BRP_TRP2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP2 */
#define IFX_CAN_N_TX_BRP_TRP2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP3 */
#define IFX_CAN_N_TX_BRP_TRP3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP3 */
#define IFX_CAN_N_TX_BRP_TRP3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP3 */
#define IFX_CAN_N_TX_BRP_TRP3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP4 */
#define IFX_CAN_N_TX_BRP_TRP4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP4 */
#define IFX_CAN_N_TX_BRP_TRP4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP4 */
#define IFX_CAN_N_TX_BRP_TRP4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP5 */
#define IFX_CAN_N_TX_BRP_TRP5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP5 */
#define IFX_CAN_N_TX_BRP_TRP5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP5 */
#define IFX_CAN_N_TX_BRP_TRP5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BRP_Bits.TRP6 */
#define IFX_CAN_N_TX_BRP_TRP6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BRP_Bits.TRP6 */
#define IFX_CAN_N_TX_BRP_TRP6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BRP_Bits.TRP6 */
#define IFX_CAN_N_TX_BRP_TRP6_OFF (6u)

