HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO1 */
#define IFX_CAN_N_TX_BTO_TO1_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO1 */
#define IFX_CAN_N_TX_BTO_TO1_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO1 */
#define IFX_CAN_N_TX_BTO_TO1_OFF (1u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO2 */
#define IFX_CAN_N_TX_BTO_TO2_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO2 */
#define IFX_CAN_N_TX_BTO_TO2_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO2 */
#define IFX_CAN_N_TX_BTO_TO2_OFF (2u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO3 */
#define IFX_CAN_N_TX_BTO_TO3_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO3 */
#define IFX_CAN_N_TX_BTO_TO3_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO3 */
#define IFX_CAN_N_TX_BTO_TO3_OFF (3u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO4 */
#define IFX_CAN_N_TX_BTO_TO4_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO4 */
#define IFX_CAN_N_TX_BTO_TO4_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO4 */
#define IFX_CAN_N_TX_BTO_TO4_OFF (4u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO5 */
#define IFX_CAN_N_TX_BTO_TO5_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO5 */
#define IFX_CAN_N_TX_BTO_TO5_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO5 */
#define IFX_CAN_N_TX_BTO_TO5_OFF (5u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO6 */
#define IFX_CAN_N_TX_BTO_TO6_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO6 */
#define IFX_CAN_N_TX_BTO_TO6_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO6 */
#define IFX_CAN_N_TX_BTO_TO6_OFF (6u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO7 */
#define IFX_CAN_N_TX_BTO_TO7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO7 */
#define IFX_CAN_N_TX_BTO_TO7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO7 */
#define IFX_CAN_N_TX_BTO_TO7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO8 */
#define IFX_CAN_N_TX_BTO_TO8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO8 */
#define IFX_CAN_N_TX_BTO_TO8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO8 */
#define IFX_CAN_N_TX_BTO_TO8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO9 */
#define IFX_CAN_N_TX_BTO_TO9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO9 */
#define IFX_CAN_N_TX_BTO_TO9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO9 */
#define IFX_CAN_N_TX_BTO_TO9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO10 */
#define IFX_CAN_N_TX_BTO_TO10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO10 */
#define IFX_CAN_N_TX_BTO_TO10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO10 */
#define IFX_CAN_N_TX_BTO_TO10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO11 */
#define IFX_CAN_N_TX_BTO_TO11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO11 */
#define IFX_CAN_N_TX_BTO_TO11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO11 */
#define IFX_CAN_N_TX_BTO_TO11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO12 */
#define IFX_CAN_N_TX_BTO_TO12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO12 */
#define IFX_CAN_N_TX_BTO_TO12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO12 */
#define IFX_CAN_N_TX_BTO_TO12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO13 */
#define IFX_CAN_N_TX_BTO_TO13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO13 */
#define IFX_CAN_N_TX_BTO_TO13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO13 */
#define IFX_CAN_N_TX_BTO_TO13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO14 */
#define IFX_CAN_N_TX_BTO_TO14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO14 */
#define IFX_CAN_N_TX_BTO_TO14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO14 */
#define IFX_CAN_N_TX_BTO_TO14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO15 */
#define IFX_CAN_N_TX_BTO_TO15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO15 */
#define IFX_CAN_N_TX_BTO_TO15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO15 */
#define IFX_CAN_N_TX_BTO_TO15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO16 */
#define IFX_CAN_N_TX_BTO_TO16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO16 */
#define IFX_CAN_N_TX_BTO_TO16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO16 */
#define IFX_CAN_N_TX_BTO_TO16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO17 */
#define IFX_CAN_N_TX_BTO_TO17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO17 */
#define IFX_CAN_N_TX_BTO_TO17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO17 */
#define IFX_CAN_N_TX_BTO_TO17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO18 */
#define IFX_CAN_N_TX_BTO_TO18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO18 */
#define IFX_CAN_N_TX_BTO_TO18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO18 */
#define IFX_CAN_N_TX_BTO_TO18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO19 */
#define IFX_CAN_N_TX_BTO_TO19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO19 */
#define IFX_CAN_N_TX_BTO_TO19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO19 */
#define IFX_CAN_N_TX_BTO_TO19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO20 */
#define IFX_CAN_N_TX_BTO_TO20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO20 */
#define IFX_CAN_N_TX_BTO_TO20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO20 */
#define IFX_CAN_N_TX_BTO_TO20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO21 */
#define IFX_CAN_N_TX_BTO_TO21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO21 */
#define IFX_CAN_N_TX_BTO_TO21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO21 */
#define IFX_CAN_N_TX_BTO_TO21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO22 */
#define IFX_CAN_N_TX_BTO_TO22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO22 */
#define IFX_CAN_N_TX_BTO_TO22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO22 */
#define IFX_CAN_N_TX_BTO_TO22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO23 */
#define IFX_CAN_N_TX_BTO_TO23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO23 */
#define IFX_CAN_N_TX_BTO_TO23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTO_Bits.TO23 */
#define IFX_CAN_N_TX_BTO_TO23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BTO_Bits.TO24 */
#define IFX_CAN_N_TX_BTO_TO24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTO_Bits.TO24 */
#define IFX_CAN_N_TX_BTO_TO24_MSK (0x1u)

