HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE7 */
#define IFX_CAN_N_TX_BTIE_TIE7_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE7 */
#define IFX_CAN_N_TX_BTIE_TIE7_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE7 */
#define IFX_CAN_N_TX_BTIE_TIE7_OFF (7u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE8 */
#define IFX_CAN_N_TX_BTIE_TIE8_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE8 */
#define IFX_CAN_N_TX_BTIE_TIE8_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE8 */
#define IFX_CAN_N_TX_BTIE_TIE8_OFF (8u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE9 */
#define IFX_CAN_N_TX_BTIE_TIE9_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE9 */
#define IFX_CAN_N_TX_BTIE_TIE9_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE9 */
#define IFX_CAN_N_TX_BTIE_TIE9_OFF (9u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE10 */
#define IFX_CAN_N_TX_BTIE_TIE10_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE10 */
#define IFX_CAN_N_TX_BTIE_TIE10_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE10 */
#define IFX_CAN_N_TX_BTIE_TIE10_OFF (10u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE11 */
#define IFX_CAN_N_TX_BTIE_TIE11_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE11 */
#define IFX_CAN_N_TX_BTIE_TIE11_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE11 */
#define IFX_CAN_N_TX_BTIE_TIE11_OFF (11u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE12 */
#define IFX_CAN_N_TX_BTIE_TIE12_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE12 */
#define IFX_CAN_N_TX_BTIE_TIE12_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE12 */
#define IFX_CAN_N_TX_BTIE_TIE12_OFF (12u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE13 */
#define IFX_CAN_N_TX_BTIE_TIE13_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE13 */
#define IFX_CAN_N_TX_BTIE_TIE13_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE13 */
#define IFX_CAN_N_TX_BTIE_TIE13_OFF (13u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE14 */
#define IFX_CAN_N_TX_BTIE_TIE14_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE14 */
#define IFX_CAN_N_TX_BTIE_TIE14_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE14 */
#define IFX_CAN_N_TX_BTIE_TIE14_OFF (14u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE15 */
#define IFX_CAN_N_TX_BTIE_TIE15_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE15 */
#define IFX_CAN_N_TX_BTIE_TIE15_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE15 */
#define IFX_CAN_N_TX_BTIE_TIE15_OFF (15u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE16 */
#define IFX_CAN_N_TX_BTIE_TIE16_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE16 */
#define IFX_CAN_N_TX_BTIE_TIE16_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE16 */
#define IFX_CAN_N_TX_BTIE_TIE16_OFF (16u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE17 */
#define IFX_CAN_N_TX_BTIE_TIE17_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE17 */
#define IFX_CAN_N_TX_BTIE_TIE17_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE17 */
#define IFX_CAN_N_TX_BTIE_TIE17_OFF (17u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE18 */
#define IFX_CAN_N_TX_BTIE_TIE18_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE18 */
#define IFX_CAN_N_TX_BTIE_TIE18_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE18 */
#define IFX_CAN_N_TX_BTIE_TIE18_OFF (18u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE19 */
#define IFX_CAN_N_TX_BTIE_TIE19_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE19 */
#define IFX_CAN_N_TX_BTIE_TIE19_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE19 */
#define IFX_CAN_N_TX_BTIE_TIE19_OFF (19u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE20 */
#define IFX_CAN_N_TX_BTIE_TIE20_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE20 */
#define IFX_CAN_N_TX_BTIE_TIE20_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE20 */
#define IFX_CAN_N_TX_BTIE_TIE20_OFF (20u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE21 */
#define IFX_CAN_N_TX_BTIE_TIE21_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE21 */
#define IFX_CAN_N_TX_BTIE_TIE21_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE21 */
#define IFX_CAN_N_TX_BTIE_TIE21_OFF (21u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE22 */
#define IFX_CAN_N_TX_BTIE_TIE22_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE22 */
#define IFX_CAN_N_TX_BTIE_TIE22_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE22 */
#define IFX_CAN_N_TX_BTIE_TIE22_OFF (22u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE23 */
#define IFX_CAN_N_TX_BTIE_TIE23_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE23 */
#define IFX_CAN_N_TX_BTIE_TIE23_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE23 */
#define IFX_CAN_N_TX_BTIE_TIE23_OFF (23u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE24 */
#define IFX_CAN_N_TX_BTIE_TIE24_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE24 */
#define IFX_CAN_N_TX_BTIE_TIE24_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE24 */
#define IFX_CAN_N_TX_BTIE_TIE24_OFF (24u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE25 */
#define IFX_CAN_N_TX_BTIE_TIE25_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE25 */
#define IFX_CAN_N_TX_BTIE_TIE25_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE25 */
#define IFX_CAN_N_TX_BTIE_TIE25_OFF (25u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE26 */
#define IFX_CAN_N_TX_BTIE_TIE26_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE26 */
#define IFX_CAN_N_TX_BTIE_TIE26_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE26 */
#define IFX_CAN_N_TX_BTIE_TIE26_OFF (26u)

/** \brief Length for Ifx_CAN_N_TX_BTIE_Bits.TIE27 */
#define IFX_CAN_N_TX_BTIE_TIE27_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TX_BTIE_Bits.TIE27 */
#define IFX_CAN_N_TX_BTIE_TIE27_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TX_BTIE_Bits.TIE27 */
#define IFX_CAN_N_TX_BTIE_TIE27_OFF (27u)

