HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_N_TT_IE_Bits.TTMIE */
#define IFX_CAN_N_TT_IE_TTMIE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.TTMIE */
#define IFX_CAN_N_TT_IE_TTMIE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.TTMIE */
#define IFX_CAN_N_TT_IE_TTMIE_OFF (5u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.SWEE */
#define IFX_CAN_N_TT_IE_SWEE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.SWEE */
#define IFX_CAN_N_TT_IE_SWEE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.SWEE */
#define IFX_CAN_N_TT_IE_SWEE_OFF (6u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.GTWE */
#define IFX_CAN_N_TT_IE_GTWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.GTWE */
#define IFX_CAN_N_TT_IE_GTWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.GTWE */
#define IFX_CAN_N_TT_IE_GTWE_OFF (7u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.GTDE */
#define IFX_CAN_N_TT_IE_GTDE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.GTDE */
#define IFX_CAN_N_TT_IE_GTDE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.GTDE */
#define IFX_CAN_N_TT_IE_GTDE_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.GTEE */
#define IFX_CAN_N_TT_IE_GTEE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.GTEE */
#define IFX_CAN_N_TT_IE_GTEE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.GTEE */
#define IFX_CAN_N_TT_IE_GTEE_OFF (9u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.TXUE */
#define IFX_CAN_N_TT_IE_TXUE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.TXUE */
#define IFX_CAN_N_TT_IE_TXUE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.TXUE */
#define IFX_CAN_N_TT_IE_TXUE_OFF (10u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.TXOE */
#define IFX_CAN_N_TT_IE_TXOE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.TXOE */
#define IFX_CAN_N_TT_IE_TXOE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.TXOE */
#define IFX_CAN_N_TT_IE_TXOE_OFF (11u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.SE1E */
#define IFX_CAN_N_TT_IE_SE1E_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.SE1E */
#define IFX_CAN_N_TT_IE_SE1E_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.SE1E */
#define IFX_CAN_N_TT_IE_SE1E_OFF (12u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.SE2E */
#define IFX_CAN_N_TT_IE_SE2E_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.SE2E */
#define IFX_CAN_N_TT_IE_SE2E_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.SE2E */
#define IFX_CAN_N_TT_IE_SE2E_OFF (13u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.ELCE */
#define IFX_CAN_N_TT_IE_ELCE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.ELCE */
#define IFX_CAN_N_TT_IE_ELCE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.ELCE */
#define IFX_CAN_N_TT_IE_ELCE_OFF (14u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.IWTE */
#define IFX_CAN_N_TT_IE_IWTE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.IWTE */
#define IFX_CAN_N_TT_IE_IWTE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.IWTE */
#define IFX_CAN_N_TT_IE_IWTE_OFF (15u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.WTE */
#define IFX_CAN_N_TT_IE_WTE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.WTE */
#define IFX_CAN_N_TT_IE_WTE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.WTE */
#define IFX_CAN_N_TT_IE_WTE_OFF (16u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.AWE */
#define IFX_CAN_N_TT_IE_AWE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.AWE */
#define IFX_CAN_N_TT_IE_AWE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.AWE */
#define IFX_CAN_N_TT_IE_AWE_OFF (17u)

/** \brief Length for Ifx_CAN_N_TT_IE_Bits.CERE */
#define IFX_CAN_N_TT_IE_CERE_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_IE_Bits.CERE */
#define IFX_CAN_N_TT_IE_CERE_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_IE_Bits.CERE */
#define IFX_CAN_N_TT_IE_CERE_OFF (18u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.EL */
#define IFX_CAN_N_TT_OST_EL_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.EL */
#define IFX_CAN_N_TT_OST_EL_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.EL */
#define IFX_CAN_N_TT_OST_EL_OFF (0u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.MS */
#define IFX_CAN_N_TT_OST_MS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.MS */
#define IFX_CAN_N_TT_OST_MS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.MS */
#define IFX_CAN_N_TT_OST_MS_OFF (2u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.SYS */
#define IFX_CAN_N_TT_OST_SYS_LEN (2u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.SYS */
#define IFX_CAN_N_TT_OST_SYS_MSK (0x3u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.SYS */
#define IFX_CAN_N_TT_OST_SYS_OFF (4u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.QGTP */
#define IFX_CAN_N_TT_OST_QGTP_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.QGTP */
#define IFX_CAN_N_TT_OST_QGTP_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.QGTP */
#define IFX_CAN_N_TT_OST_QGTP_OFF (6u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.QCS */
#define IFX_CAN_N_TT_OST_QCS_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.QCS */
#define IFX_CAN_N_TT_OST_QCS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.QCS */
#define IFX_CAN_N_TT_OST_QCS_OFF (7u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.RTO */
#define IFX_CAN_N_TT_OST_RTO_LEN (8u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.RTO */
#define IFX_CAN_N_TT_OST_RTO_MSK (0xffu)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.RTO */
#define IFX_CAN_N_TT_OST_RTO_OFF (8u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.WGTD */
#define IFX_CAN_N_TT_OST_WGTD_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.WGTD */
#define IFX_CAN_N_TT_OST_WGTD_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.WGTD */
#define IFX_CAN_N_TT_OST_WGTD_OFF (22u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.GFI */
#define IFX_CAN_N_TT_OST_GFI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.GFI */
#define IFX_CAN_N_TT_OST_GFI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.GFI */
#define IFX_CAN_N_TT_OST_GFI_OFF (23u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.TMP */
#define IFX_CAN_N_TT_OST_TMP_LEN (3u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.TMP */
#define IFX_CAN_N_TT_OST_TMP_MSK (0x7u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.TMP */
#define IFX_CAN_N_TT_OST_TMP_OFF (24u)

/** \brief Length for Ifx_CAN_N_TT_OST_Bits.GSI */
#define IFX_CAN_N_TT_OST_GSI_LEN (1u)

/** \brief Mask for Ifx_CAN_N_TT_OST_Bits.GSI */
#define IFX_CAN_N_TT_OST_GSI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_N_TT_OST_Bits.GSI */
#define IFX_CAN_N_TT_OST_GSI_OFF (27u)

