HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCan_bf.h
/** \brief Length for Ifx_CAN_R0_Bits.XTD */
#define IFX_CAN_R0_XTD_LEN (1u)

/** \brief Mask for Ifx_CAN_R0_Bits.XTD */
#define IFX_CAN_R0_XTD_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R0_Bits.XTD */
#define IFX_CAN_R0_XTD_OFF (30u)

/** \brief Length for Ifx_CAN_R0_Bits.ESI */
#define IFX_CAN_R0_ESI_LEN (1u)

/** \brief Mask for Ifx_CAN_R0_Bits.ESI */
#define IFX_CAN_R0_ESI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R0_Bits.ESI */
#define IFX_CAN_R0_ESI_OFF (31u)

/** \brief Length for Ifx_CAN_R1_Bits.RXTS */
#define IFX_CAN_R1_RXTS_LEN (16u)

/** \brief Mask for Ifx_CAN_R1_Bits.RXTS */
#define IFX_CAN_R1_RXTS_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_R1_Bits.RXTS */
#define IFX_CAN_R1_RXTS_OFF (0u)

/** \brief Length for Ifx_CAN_R1_Bits.DLC */
#define IFX_CAN_R1_DLC_LEN (4u)

/** \brief Mask for Ifx_CAN_R1_Bits.DLC */
#define IFX_CAN_R1_DLC_MSK (0xfu)

/** \brief Offset for Ifx_CAN_R1_Bits.DLC */
#define IFX_CAN_R1_DLC_OFF (16u)

/** \brief Length for Ifx_CAN_R1_Bits.BRS */
#define IFX_CAN_R1_BRS_LEN (1u)

/** \brief Mask for Ifx_CAN_R1_Bits.BRS */
#define IFX_CAN_R1_BRS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R1_Bits.BRS */
#define IFX_CAN_R1_BRS_OFF (20u)

/** \brief Length for Ifx_CAN_R1_Bits.FDF */
#define IFX_CAN_R1_FDF_LEN (1u)

/** \brief Mask for Ifx_CAN_R1_Bits.FDF */
#define IFX_CAN_R1_FDF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R1_Bits.FDF */
#define IFX_CAN_R1_FDF_OFF (21u)

/** \brief Length for Ifx_CAN_R1_Bits.FIDX */
#define IFX_CAN_R1_FIDX_LEN (7u)

/** \brief Mask for Ifx_CAN_R1_Bits.FIDX */
#define IFX_CAN_R1_FIDX_MSK (0x7fu)

/** \brief Offset for Ifx_CAN_R1_Bits.FIDX */
#define IFX_CAN_R1_FIDX_OFF (24u)

/** \brief Length for Ifx_CAN_R1_Bits.ANMF */
#define IFX_CAN_R1_ANMF_LEN (1u)

/** \brief Mask for Ifx_CAN_R1_Bits.ANMF */
#define IFX_CAN_R1_ANMF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_R1_Bits.ANMF */
#define IFX_CAN_R1_ANMF_OFF (31u)

/** \brief Length for Ifx_CAN_DB_Bits.DB */
#define IFX_CAN_DB_DB_LEN (8u)

/** \brief Mask for Ifx_CAN_DB_Bits.DB */
#define IFX_CAN_DB_DB_MSK (0xffu)

/** \brief Offset for Ifx_CAN_DB_Bits.DB */
#define IFX_CAN_DB_DB_OFF (0u)

/** \brief Length for Ifx_CAN_TXEVENT_E0_Bits.ID */
#define IFX_CAN_TXEVENT_E0_ID_LEN (29u)

/** \brief Mask for Ifx_CAN_TXEVENT_E0_Bits.ID */
#define IFX_CAN_TXEVENT_E0_ID_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_TXEVENT_E0_Bits.ID */
#define IFX_CAN_TXEVENT_E0_ID_OFF (0u)

/** \brief Length for Ifx_CAN_TXEVENT_E0_Bits.RTR */
#define IFX_CAN_TXEVENT_E0_RTR_LEN (1u)

/** \brief Mask for Ifx_CAN_TXEVENT_E0_Bits.RTR */
#define IFX_CAN_TXEVENT_E0_RTR_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXEVENT_E0_Bits.RTR */
#define IFX_CAN_TXEVENT_E0_RTR_OFF (29u)

/** \brief Length for Ifx_CAN_TXEVENT_E0_Bits.XTD */
#define IFX_CAN_TXEVENT_E0_XTD_LEN (1u)

/** \brief Mask for Ifx_CAN_TXEVENT_E0_Bits.XTD */
#define IFX_CAN_TXEVENT_E0_XTD_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXEVENT_E0_Bits.XTD */
#define IFX_CAN_TXEVENT_E0_XTD_OFF (30u)

/** \brief Length for Ifx_CAN_TXEVENT_E0_Bits.ESI */
#define IFX_CAN_TXEVENT_E0_ESI_LEN (1u)

/** \brief Mask for Ifx_CAN_TXEVENT_E0_Bits.ESI */
#define IFX_CAN_TXEVENT_E0_ESI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXEVENT_E0_Bits.ESI */
#define IFX_CAN_TXEVENT_E0_ESI_OFF (31u)

/** \brief Length for Ifx_CAN_TXEVENT_E1_Bits.TXTS */
#define IFX_CAN_TXEVENT_E1_TXTS_LEN (16u)

/** \brief Mask for Ifx_CAN_TXEVENT_E1_Bits.TXTS */
#define IFX_CAN_TXEVENT_E1_TXTS_MSK (0xffffu)

/** \brief Offset for Ifx_CAN_TXEVENT_E1_Bits.TXTS */
#define IFX_CAN_TXEVENT_E1_TXTS_OFF (0u)

/** \brief Length for Ifx_CAN_TXEVENT_E1_Bits.DLC */
#define IFX_CAN_TXEVENT_E1_DLC_LEN (4u)

/** \brief Mask for Ifx_CAN_TXEVENT_E1_Bits.DLC */
#define IFX_CAN_TXEVENT_E1_DLC_MSK (0xfu)

/** \brief Offset for Ifx_CAN_TXEVENT_E1_Bits.DLC */
#define IFX_CAN_TXEVENT_E1_DLC_OFF (16u)

/** \brief Length for Ifx_CAN_TXEVENT_E1_Bits.BRS */
#define IFX_CAN_TXEVENT_E1_BRS_LEN (1u)

/** \brief Mask for Ifx_CAN_TXEVENT_E1_Bits.BRS */
#define IFX_CAN_TXEVENT_E1_BRS_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXEVENT_E1_Bits.BRS */
#define IFX_CAN_TXEVENT_E1_BRS_OFF (20u)

/** \brief Length for Ifx_CAN_TXEVENT_E1_Bits.FDF */
#define IFX_CAN_TXEVENT_E1_FDF_LEN (1u)

/** \brief Mask for Ifx_CAN_TXEVENT_E1_Bits.FDF */
#define IFX_CAN_TXEVENT_E1_FDF_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXEVENT_E1_Bits.FDF */
#define IFX_CAN_TXEVENT_E1_FDF_OFF (21u)

/** \brief Length for Ifx_CAN_TXEVENT_E1_Bits.ET */
#define IFX_CAN_TXEVENT_E1_ET_LEN (2u)

/** \brief Mask for Ifx_CAN_TXEVENT_E1_Bits.ET */
#define IFX_CAN_TXEVENT_E1_ET_MSK (0x3u)

/** \brief Offset for Ifx_CAN_TXEVENT_E1_Bits.ET */
#define IFX_CAN_TXEVENT_E1_ET_OFF (22u)

/** \brief Length for Ifx_CAN_TXEVENT_E1_Bits.MM */
#define IFX_CAN_TXEVENT_E1_MM_LEN (8u)

/** \brief Mask for Ifx_CAN_TXEVENT_E1_Bits.MM */
#define IFX_CAN_TXEVENT_E1_MM_MSK (0xffu)

/** \brief Offset for Ifx_CAN_TXEVENT_E1_Bits.MM */
#define IFX_CAN_TXEVENT_E1_MM_OFF (24u)

/** \brief Length for Ifx_CAN_TXMSG_T0_Bits.ID */
#define IFX_CAN_TXMSG_T0_ID_LEN (29u)

/** \brief Mask for Ifx_CAN_TXMSG_T0_Bits.ID */
#define IFX_CAN_TXMSG_T0_ID_MSK (0x1fffffffu)

/** \brief Offset for Ifx_CAN_TXMSG_T0_Bits.ID */
#define IFX_CAN_TXMSG_T0_ID_OFF (0u)

/** \brief Length for Ifx_CAN_TXMSG_T0_Bits.RTR */
#define IFX_CAN_TXMSG_T0_RTR_LEN (1u)

/** \brief Mask for Ifx_CAN_TXMSG_T0_Bits.RTR */
#define IFX_CAN_TXMSG_T0_RTR_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXMSG_T0_Bits.RTR */
#define IFX_CAN_TXMSG_T0_RTR_OFF (29u)

/** \brief Length for Ifx_CAN_TXMSG_T0_Bits.XTD */
#define IFX_CAN_TXMSG_T0_XTD_LEN (1u)

/** \brief Mask for Ifx_CAN_TXMSG_T0_Bits.XTD */
#define IFX_CAN_TXMSG_T0_XTD_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXMSG_T0_Bits.XTD */
#define IFX_CAN_TXMSG_T0_XTD_OFF (30u)

/** \brief Length for Ifx_CAN_TXMSG_T0_Bits.ESI */
#define IFX_CAN_TXMSG_T0_ESI_LEN (1u)

/** \brief Mask for Ifx_CAN_TXMSG_T0_Bits.ESI */
#define IFX_CAN_TXMSG_T0_ESI_MSK (0x1u)

/** \brief Offset for Ifx_CAN_TXMSG_T0_Bits.ESI */
#define IFX_CAN_TXMSG_T0_ESI_OFF (31u)

/** \brief Length for Ifx_CAN_TXMSG_T1_Bits.DLC */
#define IFX_CAN_TXMSG_T1_DLC_LEN (4u)

/** \brief Mask for Ifx_CAN_TXMSG_T1_Bits.DLC */
#define IFX_CAN_TXMSG_T1_DLC_MSK (0xfu)

/** \brief Offset for Ifx_CAN_TXMSG_T1_Bits.DLC */
#define IFX_CAN_TXMSG_T1_DLC_OFF (16u)

